* add.cob :
IDENTIFICATION  DIVISION.
PROGRAM-ID.     ADD_program.
ENVIRONMENT     DIVISION.
DATA            DIVISION.
WORKING-STORAGE  SECTION.
01 NUM1  PIC 9999 VALUE 0.
01 NUM2  PIC 9999.
01 TOTAL  PIC 99999.
PROCEDURE       DIVISION.

DISPLAY SPACE.
DISPLAY 'Number1:'.
ACCEPT NUM1.
DISPLAY 'Number2:'.
ACCEPT NUM2.
COMPUTE TOTAL = NUM1 + NUM2.
DISPLAY 'TOTAL:' TOTAL.
   STOP RUN.
